; ModuleID = 'fa_orig.bc'
source_filename = "fast_algorithms.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.plan7_s = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i32*, i32, i32*, i32*, i32*, float, float, float, float, float, float, i32, float**, float**, float**, float, [4 x [2 x float]], float*, float*, [20 x float], float, i32**, i32**, i32**, [4 x [2 x i32]], i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32**, i32**, i32, i32, float, float, i32 }
%struct.dpmatrix_s = type { i32**, i32**, i32**, i32**, i8*, i8*, i8*, i8*, i32, i32, i32, i32 }
%struct.p7trace_s = type { i32, i8*, i32*, i32* }

; Function Attrs: noinline nounwind optnone uwtable
define dso_local float @P7Viterbi(i8* noundef %dsq, i32 noundef %L, %struct.plan7_s* noundef %hmm, %struct.dpmatrix_s* noundef %mx, %struct.p7trace_s** noundef %ret_tr) #0 !dbg !11 {
entry:
  %dsq.addr = alloca i8*, align 8
  %L.addr = alloca i32, align 4
  %hmm.addr = alloca %struct.plan7_s*, align 8
  %mx.addr = alloca %struct.dpmatrix_s*, align 8
  %ret_tr.addr = alloca %struct.p7trace_s**, align 8
  %tr = alloca %struct.p7trace_s*, align 8
  %xmx = alloca i32**, align 8
  %mmx = alloca i32**, align 8
  %imx = alloca i32**, align 8
  %dmx = alloca i32**, align 8
  %i = alloca i32, align 4
  %k = alloca i32, align 4
  %sc = alloca i32, align 4
  %mc = alloca i32*, align 8
  %dc = alloca i32*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.6 (https://github.com/llvm/llvm-project.git f28c006a5895fc0e329fe15fead81e37457cb1d1)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "fast_algorithms.c", directory: "/n/eecs583b/home/zderosia/final/EECS_583_Final_Project/Benchmarks/CINT2006_full/456.hmmer/src", checksumkind: CSK_MD5, checksum: "eac9a314a0439eb39fcedfa743374304")
!2 = !{!3, !4}
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 5}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{i32 7, !"uwtable", i32 1}
!9 = !{i32 7, !"frame-pointer", i32 2}
!10 = !{!"clang version 14.0.6 (https://github.com/llvm/llvm-project.git f28c006a5895fc0e329fe15fead81e37457cb1d1)"}
!11 = distinct !DISubprogram(name: "P7Viterbi", scope: !1, file: !1, line: 69, type: !12, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !104)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !3, !17, !81, !96}
!14 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plan7_s", file: !19, line: 101, size: 3712, elements: !20)
!19 = !DIFile(filename: "./structs.h", directory: "/n/eecs583b/home/zderosia/final/EECS_583_Final_Project/Benchmarks/CINT2006_full/456.hmmer/src", checksumkind: CSK_MD5, checksum: "c0b2592c6453f33fb94e12cad3b97de1")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !46, !47, !48, !49, !54, !55, !56, !60, !61, !63, !64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !18, file: !19, line: 113, baseType: !15, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "acc", scope: !18, file: !19, line: 114, baseType: !15, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !18, file: !19, line: 115, baseType: !15, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rf", scope: !18, file: !19, line: 116, baseType: !15, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !18, file: !19, line: 117, baseType: !15, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !18, file: !19, line: 118, baseType: !15, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "comlog", scope: !18, file: !19, line: 119, baseType: !15, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nseq", scope: !18, file: !19, line: 120, baseType: !3, size: 32, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !18, file: !19, line: 121, baseType: !15, size: 64, offset: 512)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !18, file: !19, line: 122, baseType: !31, size: 64, offset: 576)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !18, file: !19, line: 123, baseType: !3, size: 32, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tpri", scope: !18, file: !19, line: 134, baseType: !31, size: 64, offset: 704)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mpri", scope: !18, file: !19, line: 135, baseType: !31, size: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ipri", scope: !18, file: !19, line: 136, baseType: !31, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ga1", scope: !18, file: !19, line: 144, baseType: !14, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ga2", scope: !18, file: !19, line: 144, baseType: !14, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tc1", scope: !18, file: !19, line: 145, baseType: !14, size: 32, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tc2", scope: !18, file: !19, line: 145, baseType: !14, size: 32, offset: 992)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "nc1", scope: !18, file: !19, line: 146, baseType: !14, size: 32, offset: 1024)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nc2", scope: !18, file: !19, line: 146, baseType: !14, size: 32, offset: 1056)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !18, file: !19, line: 155, baseType: !3, size: 32, offset: 1088)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !18, file: !19, line: 156, baseType: !44, size: 64, offset: 1152)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !18, file: !19, line: 157, baseType: !44, size: 64, offset: 1216)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ins", scope: !18, file: !19, line: 158, baseType: !44, size: 64, offset: 1280)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tbd1", scope: !18, file: !19, line: 159, baseType: !14, size: 32, offset: 1344)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "xt", scope: !18, file: !19, line: 168, baseType: !50, size: 256, offset: 1376)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !51)
!51 = !{!52, !53}
!52 = !DISubrange(count: 4)
!53 = !DISubrange(count: 2)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !18, file: !19, line: 169, baseType: !45, size: 64, offset: 1664)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !18, file: !19, line: 170, baseType: !45, size: 64, offset: 1728)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !18, file: !19, line: 174, baseType: !57, size: 640, offset: 1792)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 640, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !18, file: !19, line: 175, baseType: !14, size: 32, offset: 2432)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tsc", scope: !18, file: !19, line: 197, baseType: !62, size: 64, offset: 2496)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "msc", scope: !18, file: !19, line: 198, baseType: !62, size: 64, offset: 2560)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "isc", scope: !18, file: !19, line: 199, baseType: !62, size: 64, offset: 2624)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "xsc", scope: !18, file: !19, line: 200, baseType: !66, size: 256, offset: 2688)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 256, elements: !51)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "bsc", scope: !18, file: !19, line: 201, baseType: !31, size: 64, offset: 2944)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !18, file: !19, line: 202, baseType: !31, size: 64, offset: 3008)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_mem", scope: !18, file: !19, line: 203, baseType: !31, size: 64, offset: 3072)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "msc_mem", scope: !18, file: !19, line: 203, baseType: !31, size: 64, offset: 3136)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "isc_mem", scope: !18, file: !19, line: 203, baseType: !31, size: 64, offset: 3200)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "bsc_mem", scope: !18, file: !19, line: 203, baseType: !31, size: 64, offset: 3264)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "esc_mem", scope: !18, file: !19, line: 203, baseType: !31, size: 64, offset: 3328)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dnam", scope: !18, file: !19, line: 214, baseType: !62, size: 64, offset: 3392)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "dnai", scope: !18, file: !19, line: 215, baseType: !62, size: 64, offset: 3456)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "dna2", scope: !18, file: !19, line: 216, baseType: !3, size: 32, offset: 3520)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "dna4", scope: !18, file: !19, line: 217, baseType: !3, size: 32, offset: 3552)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !18, file: !19, line: 222, baseType: !14, size: 32, offset: 3584)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "lambda", scope: !18, file: !19, line: 223, baseType: !14, size: 32, offset: 3616)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !18, file: !19, line: 225, baseType: !3, size: 32, offset: 3648)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpmatrix_s", file: !19, line: 289, size: 640, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xmx", scope: !82, file: !19, line: 290, baseType: !62, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mmx", scope: !82, file: !19, line: 291, baseType: !62, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "imx", scope: !82, file: !19, line: 292, baseType: !62, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dmx", scope: !82, file: !19, line: 293, baseType: !62, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "xmx_mem", scope: !82, file: !19, line: 299, baseType: !4, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mmx_mem", scope: !82, file: !19, line: 299, baseType: !4, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "imx_mem", scope: !82, file: !19, line: 299, baseType: !4, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dmx_mem", scope: !82, file: !19, line: 299, baseType: !4, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "maxN", scope: !82, file: !19, line: 308, baseType: !3, size: 32, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "maxM", scope: !82, file: !19, line: 309, baseType: !3, size: 32, offset: 544)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "padN", scope: !82, file: !19, line: 311, baseType: !3, size: 32, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "padM", scope: !82, file: !19, line: 312, baseType: !3, size: 32, offset: 608)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "p7trace_s", file: !19, line: 374, size: 256, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tlen", scope: !98, file: !19, line: 375, baseType: !3, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "statetype", scope: !98, file: !19, line: 376, baseType: !15, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nodeidx", scope: !98, file: !19, line: 377, baseType: !31, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !98, file: !19, line: 378, baseType: !31, size: 64, offset: 192)
!104 = !{}
!105 = !DILocalVariable(name: "dsq", arg: 1, scope: !11, file: !1, line: 69, type: !15)
!106 = !DILocation(line: 69, column: 17, scope: !11)
!107 = !DILocalVariable(name: "L", arg: 2, scope: !11, file: !1, line: 69, type: !3)
!108 = !DILocation(line: 69, column: 26, scope: !11)
!109 = !DILocalVariable(name: "hmm", arg: 3, scope: !11, file: !1, line: 69, type: !17)
!110 = !DILocation(line: 69, column: 45, scope: !11)
!111 = !DILocalVariable(name: "mx", arg: 4, scope: !11, file: !1, line: 69, type: !81)
!112 = !DILocation(line: 69, column: 69, scope: !11)
!113 = !DILocalVariable(name: "ret_tr", arg: 5, scope: !11, file: !1, line: 69, type: !96)
!114 = !DILocation(line: 69, column: 92, scope: !11)
!115 = !DILocalVariable(name: "tr", scope: !11, file: !1, line: 78, type: !97)
!116 = !DILocation(line: 78, column: 22, scope: !11)
!117 = !DILocalVariable(name: "xmx", scope: !11, file: !1, line: 79, type: !62)
!118 = !DILocation(line: 79, column: 9, scope: !11)
!119 = !DILocalVariable(name: "mmx", scope: !11, file: !1, line: 80, type: !62)
!120 = !DILocation(line: 80, column: 9, scope: !11)
!121 = !DILocalVariable(name: "imx", scope: !11, file: !1, line: 81, type: !62)
!122 = !DILocation(line: 81, column: 9, scope: !11)
!123 = !DILocalVariable(name: "dmx", scope: !11, file: !1, line: 82, type: !62)
!124 = !DILocation(line: 82, column: 9, scope: !11)
!125 = !DILocalVariable(name: "i", scope: !11, file: !1, line: 83, type: !3)
!126 = !DILocation(line: 83, column: 9, scope: !11)
!127 = !DILocalVariable(name: "k", scope: !11, file: !1, line: 83, type: !3)
!128 = !DILocation(line: 83, column: 11, scope: !11)
!129 = !DILocalVariable(name: "sc", scope: !11, file: !1, line: 84, type: !3)
!130 = !DILocation(line: 84, column: 9, scope: !11)
!131 = !DILocalVariable(name: "mc", scope: !11, file: !1, line: 85, type: !31)
!132 = !DILocation(line: 85, column: 9, scope: !11)
!133 = !DILocalVariable(name: "dc", scope: !11, file: !1, line: 85, type: !31)
!134 = !DILocation(line: 85, column: 14, scope: !11)
!135 = !DILocalVariable(name: "ic", scope: !11, file: !1, line: 85, type: !31)
!136 = !DILocation(line: 85, column: 19, scope: !11)
!137 = !DILocalVariable(name: "ms", scope: !11, file: !1, line: 86, type: !31)
!138 = !DILocation(line: 86, column: 9, scope: !11)
!139 = !DILocalVariable(name: "is", scope: !11, file: !1, line: 86, type: !31)
!140 = !DILocation(line: 86, column: 14, scope: !11)
!141 = !DILocalVariable(name: "mpp", scope: !11, file: !1, line: 87, type: !31)
!142 = !DILocation(line: 87, column: 9, scope: !11)
!143 = !DILocalVariable(name: "mpc", scope: !11, file: !1, line: 87, type: !31)
!144 = !DILocation(line: 87, column: 15, scope: !11)
!145 = !DILocalVariable(name: "ip", scope: !11, file: !1, line: 87, type: !31)
!146 = !DILocation(line: 87, column: 21, scope: !11)
!147 = !DILocalVariable(name: "bp", scope: !11, file: !1, line: 88, type: !31)
!148 = !DILocation(line: 88, column: 9, scope: !11)
!149 = !DILocalVariable(name: "ep", scope: !11, file: !1, line: 89, type: !31)
!150 = !DILocation(line: 89, column: 9, scope: !11)
!151 = !DILocalVariable(name: "xmb", scope: !11, file: !1, line: 90, type: !3)
!152 = !DILocation(line: 90, column: 9, scope: !11)
!153 = !DILocalVariable(name: "xme", scope: !11, file: !1, line: 91, type: !3)
!154 = !DILocation(line: 91, column: 9, scope: !11)
!155 = !DILocalVariable(name: "dpp", scope: !11, file: !1, line: 92, type: !31)
!156 = !DILocation(line: 92, column: 9, scope: !11)
!157 = !DILocalVariable(name: "tpmm", scope: !11, file: !1, line: 93, type: !31)
!158 = !DILocation(line: 93, column: 9, scope: !11)
!159 = !DILocalVariable(name: "tpmi", scope: !11, file: !1, line: 93, type: !31)
!160 = !DILocation(line: 93, column: 16, scope: !11)
!161 = !DILocalVariable(name: "tpmd", scope: !11, file: !1, line: 93, type: !31)
!162 = !DILocation(line: 93, column: 23, scope: !11)
